[
  {
    "bookId": 1,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.postimg.cc/MHXDTFX0/To-Kill-a-Mockingbird.jpg",
    "review": "Harper Lee's 'To Kill a Mockingbird' is a timeless classic that explores themes of racism, justice, and compassion in the American South. Through the eyes of young Scout Finch, readers are transported to the fictional town of Maycomb, Alabama, where her father, Atticus Finch, defends a black man falsely accused of raping a white woman. 'To Kill a Mockingbird' is a poignant and thought-provoking novel that continues to resonate with readers of all ages.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classic", "Southern Literature"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 2,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.postimg.cc/3RLw1L1c/1984.jpg",
    "review": "George Orwell's '1984' is a dystopian masterpiece that paints a chilling portrait of a totalitarian society. Set in a world where individuality is suppressed and government surveillance is omnipresent, '1984' follows the story of Winston Smith, a low-ranking member of the ruling Party who dares to rebel against the oppressive regime. Orwell's novel remains as relevant today as it was when it was first published, serving as a cautionary tale about the dangers of authoritarianism and the erosion of personal freedoms.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Dystopian", "Political Fiction"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 3,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.postimg.cc/wjLTZ5g0/Pride-and-Prejudice.jpg",
    "review": "Jane Austen's 'Pride and Prejudice' is a timeless romance that continues to captivate readers more than two centuries after its publication. Set in early 19th-century England, the novel follows the tumultuous relationship between the spirited Elizabeth Bennet and the enigmatic Mr. Darcy. Through sharp wit and keen observation, Austen explores themes of love, class, and societal expectations. 'Pride and Prejudice' is a literary classic that remains as relevant today as it was when it was first penned.",
    "totalPages": 432,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Romance", "Regency Era"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 4,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.postimg.cc/PrLRt2Lz/The-Great-Gatsby.jpg",
    "review": "F. Scott Fitzgerald's 'The Great Gatsby' is a poignant exploration of the American Dream and the emptiness of wealth and privilege. Set in the Roaring Twenties, the novel follows the enigmatic Jay Gatsby and his obsession with the beautiful Daisy Buchanan. Through vivid prose and lush imagery, Fitzgerald paints a portrait of a society consumed by excess and decadence. 'The Great Gatsby' is a timeless classic that continues to resonate with readers for its themes of love, loss, and the pursuit of happiness.",
    "totalPages": 200,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["American Literature", "Roaring Twenties"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J. D. Salinger",
    "image": "https://i.postimg.cc/NMxGNQ8D/The-Catcher-in-the-Rye.jpg",
    "review": "J. D. Salinger's 'The Catcher in the Rye' is a coming-of-age novel that has left an indelible mark on American literature. Narrated by the disillusioned teenager Holden Caulfield, the novel explores themes of alienation, identity, and the search for authenticity. Salinger's iconic protagonist and distinctive voice have resonated with generations of readers, making 'The Catcher in the Rye' a timeless classic that continues to captivate audiences around the world.",
    "totalPages": 224,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Coming-of-Age", "American Literature"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J. R. R. Tolkien",
    "image": "https://i.postimg.cc/Nj7Hhvxy/The-Hobbit.jpg",
    "review": "J. R. R. Tolkien's 'The Hobbit' is a beloved fantasy adventure that transports readers to the enchanting world of Middle-earth. Follow the journey of Bilbo Baggins, a humble hobbit who is swept into an epic quest to reclaim the lost kingdom of Erebor from the fearsome dragon Smaug. Filled with memorable characters, thrilling action, and rich mythology, 'The Hobbit' is a timeless tale of courage, friendship, and the power of imagination.",
    "totalPages": 310,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Adventure", "Middle-earth"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 7,
    "bookName": "The Power of Habit",
    "author": "Charles Duhigg",
    "image": "https://i.postimg.cc/rp5qm5mz/The-Power-of-Habit.jpg",
    "review": "Charles Duhigg's 'The Power of Habit' is a fascinating exploration of the science behind habits. Drawing on research from psychology, neuroscience, and sociology, Duhigg reveals the key to making lasting change in our lives. 'The Power of Habit' offers practical insights and actionable strategies for breaking bad habits and forming new ones.",
    "totalPages": 400,
    "rating": 4.4,
    "category": "Self-Help",
    "tags": ["Psychology", "Behavior"],
    "publisher": "Random House",
    "yearOfPublishing": 2012
  },
  {
    "bookId": 8,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.postimg.cc/TYjSpQjz/The-Alchemist.jpg",
    "review": "Paulo Coelho's 'The Alchemist' is a timeless tale of self-discovery and personal legend. Set against the backdrop of the Andalusian desert, the novel follows Santiago, a young shepherd boy who embarks on a journey to fulfill his dreams. Along the way, he encounters a series of characters who impart wisdom and guidance, teaching him valuable lessons about life, love, and the pursuit of one's destiny. 'The Alchemist' is a captivating allegory that reminds readers to listen to their hearts and follow their dreams.",
    "totalPages": 208,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Philosophical", "Adventure"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 9,
    "bookName": "The Lord of the Rings",
    "author": "J. R. R. Tolkien",
    "image": "https://i.postimg.cc/SRbG7F7m/The-Lord-of-the-Rings.jpg",
    "review": "J. R. R. Tolkien's 'The Lord of the Rings' is an epic fantasy saga that has captivated readers for generations. Set in the fictional world of Middle-earth, the trilogy follows the quest to destroy the One Ring and defeat the dark lord Sauron. With its richly imagined world, complex characters, and epic battles, 'The Lord of the Rings' is a timeless masterpiece of fantasy literature.",
    "totalPages": 1216,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Epic", "High Fantasy"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1954
  },
  {
    "bookId": 10,
    "bookName": "You Can Win",
    "author": "Shiv Khera",
    "image": "https://i.postimg.cc/vBB9qRWp/You-Can-Win.jpg",
    "review": "Shiv Khera's 'You Can Win' is a motivational book that empowers readers to achieve success and fulfillment in their personal and professional lives. Through inspiring anecdotes and practical advice, Khera outlines key principles for success, emphasizing the importance of positive thinking, goal setting, and perseverance. 'You Can Win' serves as a guidebook for unlocking one's full potential and realizing dreams.",
    "totalPages": 308,
    "rating": 4.4,
    "category": "Self-Help",
    "tags": ["Motivation", "Success"],
    "publisher": "Bloomsbury India",
    "yearOfPublishing": 1998
  },
  {
    "bookId": 11,
    "bookName": "Atomic Habits",
    "author": "James Clear",
    "image": "https://i.postimg.cc/02BwQH1f/Atomic-Habits.jpg",
    "review": "James Clear's 'Atomic Habits' is a groundbreaking guide to building good habits and breaking bad ones. Drawing on scientific research and real-life examples, Clear reveals practical strategies for creating lasting change and achieving remarkable results. From small, incremental changes to the power of habit stacking, this book provides actionable insights that can transform your life. Whether you want to improve your health, productivity, or relationships, 'Atomic Habits' offers a roadmap to success.",
    "totalPages": 320,
    "rating": 4.8,
    "category": "Self-Help",
    "tags": ["Habits", "Personal Development"],
    "publisher": "Avery",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 12,
    "bookName": "The Fault in Our Stars",
    "author": "John Green",
    "image": "https://i.postimg.cc/766Zz07k/The-Fault-in-Our-Stars.jpg",
    "review": "John Green's 'The Fault in Our Stars' is a heart-wrenching and poignant novel that explores the complexities of love and loss. The story follows Hazel Grace Lancaster, a sixteen-year-old cancer patient, who meets and falls in love with Augustus Waters, a fellow cancer survivor, at a support group. Together, they navigate the challenges of illness, mortality, and the search for meaning in their limited time together. 'The Fault in Our Stars' is a beautifully written and emotionally resonant story that will stay with readers long after they've turned the final page.",
    "totalPages": 313,
    "rating": 4.5,
    "category": "Young Adult",
    "tags": ["Romance", "Contemporary"],
    "publisher": "Dutton Books",
    "yearOfPublishing": 2012
  }
]
